start_text_unauth = """
Привіт, {first_name}! 👋

Я — бот, який допоможе тобі знайти найсвіжіші проєкти з платформи Freelancehunt.

🔎 Що я вмію:
— Шукати нові фриланс-проєкти за твоїми вподобаннями
— Фільтрувати завдання за тематикою, бюджетом та кількістю заявок
— Надсилати повідомлення, щойно з'являється новий відповідний проєкт
— Допомагати не пропустити вигідні замовлення

📌 Щоб розпочати, обери теми, які тебе цікавлять нижче 👇
"""

start_text_auth = """
👋 Привіт знову, {first_name}!

Ти вже зареєстрований у системі ✅

🔧 Якщо хочеш оновити теми чи фільтри — скористайся кнопками нижче.

🆕 Нові проєкти з твоїх тем надходитимуть автоматично. 
Слідкуй, щоб нічого не пропустити 😉
"""

start_text_no_categories = """
👋 Привіт, {first_name}!

Ти вже зареєстрований у системі ✅

❗️ Але схоже, що ти ще не обрав категорії проєктів, які тебе цікавлять.

📌 Обери теми для пошуку проєктів за допомогою кнопки нижче, щоб почати отримувати сповіщення.

🔧 Ти завжди зможеш змінити налаштування у будь-який момент.
"""

register_category_items_text = """
Оберіть підтеми для категорії "{category_name}":
"""

register_main_text = """
Оберіть тему, для якої хочете налаштувати пошук проєктів:

Обрані підтеми:
{selected_items}
"""

register_success_text = """
🎉 Ви успішно обрали категорії та підтеми для пошуку проєктів!\n
Тепер ви будете отримувати сповіщення про нові проєкти, що відповідають вашим інтересам.\n
Щоб змінити налаштування, скористайтеся кнопками нижче👇
"""